# 1 - Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# *Пример:*
# - 6782 -> 23
# - 0,56 -> 11
# float_num = input('Введите вещественное число: ')
# print(type(float_num))
# sum = 0
# for i in float_num:
#     if i != '.':
#         sum += int(i)
# print(sum)
# # ===========================================================================
# # 2 - Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# # *Пример:*
# # - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

# n = int(input('Введите N: '))
# factorial = 1
# for i in range(1, n+1):
#     factorial *= i
#     print(factorial, end=' ')
# ==================================================================================
# 3 - Задайте список из n чисел последовательности (1+1/n)**n и выведите на экран их сумму.
# *Пример:*
# - Для n = 6: {1: 2.0, 2: 2.25, 3: 2.37037037037037, 4: 2.44140625, 5: 2.4883199999999994, 6: 2.5216263717421135}

# from msilib import sequence

# n = int(input('Введите число: ')) 

# def get_squerence(n):
#     return [round((1 + 1 / x)**x, 5) for x in range (1, n + 1)]

# nums = get_squerence(n)
# print(nums)
# print(round(sum(nums), 5))

# 4 - Реализуйте выдачу случайного числа (или алгоритм перемешивания списка)
# не использовать random.randint и вообще библиотеку random
# Можете использовать xor, биты, библиотеку time (миллисекунды или наносекунды) - для задания случайности
# from time import time
# print(f'Случайное число от 0 до 99 = {int(time() % 1 * 100)}')

# # x(n + 1) = (a * x (n) + b) % m
# m = 100
# b = 3
# a = 2
# x = 1
# c = 50

# list = []

# for i in range (c):
#     x = (a * x + b) % m
#     list.append(x)

# print(list)